; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v4 - type_1 ?v7 - type_3)
 	      (pred_4 ?v2 - object ?v7 - type_3)
	      (pred_2 ?v4 - type_1 ?v8 - type_2)
	      (pred_1 ?v4 - type_1 ?v2 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v4 - type_1 ?v6 ?v5 - type_3)
       :precondition (and  (pred_3 ?v4 ?v6))
       :effect (and  (pred_3 ?v4 ?v5)
		     (not (pred_3 ?v4 ?v6))))

   (:action op_1
       :parameters (?v4 - type_1 ?v1 - object ?v3 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v3) (pred_3 ?v4 ?v3) (pred_2 ?v4 ?v8))
       :effect (and (pred_1 ?v4 ?v1 ?v8)
		    (not (pred_4 ?v1 ?v3)) 
		    (not (pred_2 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_1 ?v1 - object ?v3 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v1 ?v8) (pred_3 ?v4 ?v3))
       :effect (and (pred_4 ?v1 ?v3)
		    (pred_2 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v1 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_04 - type_1
obj_09 obj_01 - type_2
obj_08 obj_02 obj_03 obj_07 - type_3
obj_10 obj_06 obj_05 - object)
(:init
(pred_3 obj_04 obj_08)
(pred_2 obj_04 obj_09)
(pred_2 obj_04 obj_01)
(pred_4 obj_10 obj_02)
(pred_4 obj_06 obj_08)
(pred_4 obj_05 obj_02)
)
(:goal
(and
(pred_4 obj_10 obj_03)
(pred_4 obj_06 obj_07)
(pred_4 obj_05 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_04 ?b obj_01))))
)
)

; plan
1. (op_1 obj_04 obj_06 obj_08 obj_09)
   deleted: (pred_4 obj_06 obj_08) (pred_2 obj_04 obj_09)
   added: (pred_1 obj_04 obj_06 obj_09)
   goals met: 1 of 3
2. (op_3 obj_04 obj_08 obj_07)
   deleted: (pred_3 obj_04 obj_08)
   added: (pred_3 obj_04 obj_07)
   goals met: 1 of 3
3. (op_2 obj_04 obj_06 obj_07 obj_09)
   deleted: (pred_1 obj_04 obj_06 obj_09)
   added: (pred_4 obj_06 obj_07) (pred_2 obj_04 obj_09)
   goals met: 2 of 3
4. (op_3 obj_04 obj_07 obj_02)
   deleted: (pred_3 obj_04 obj_07)
   added: (pred_3 obj_04 obj_02)
   goals met: 2 of 3
5. (op_1 obj_04 obj_10 obj_02 obj_09)
   deleted: (pred_4 obj_10 obj_02) (pred_2 obj_04 obj_09)
   added: (pred_1 obj_04 obj_10 obj_09)
   goals met: 2 of 3
6. (op_3 obj_04 obj_02 obj_03)
   deleted: (pred_3 obj_04 obj_02)
   added: (pred_3 obj_04 obj_03)
   goals met: 2 of 3
7. (op_2 obj_04 obj_10 obj_03 obj_09)
   deleted: (pred_1 obj_04 obj_10 obj_09)
   added: (pred_4 obj_10 obj_03) (pred_2 obj_04 obj_09)
   goals met: 3 of 3
